<!-- dflook/terraform-github-actions {"workspace":"partial-cloud","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"8c0d44332ebd49a704da5b72d091d907386fb0f69abdf7708f7a3cdef03a42f7","plan_job_ref":"Job Test plan target and replace #335 at https://github.com/dflook/terraform-github-actions/actions/runs/5293226573","plan_hash":"d40d45a3549fec9054e9fb3dc20713a4a09f13a42a6b09b98ed08168f971734f","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __partial-cloud__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "dA6lbkoTgF" -> (known after apply)
  ~ foreach = "td50WZ3YwT" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #335](https://github.com/dflook/terraform-github-actions/actions/runs/5293226573)